app/controllers/cheese_libraries_controller.rb

  def index
    @title = t "index.title"
    set_show_session
    set_index_session

    @cheeses = Array.new
    @milk_type = MilkType.find_by_milk_type(params[:composition]) || MilkType.find_by_milk_type_in_french(params[:composition]) unless params[:composition].nil? || params[:composition] == "All" || params[:composition].blank?
    @cheese_type = CheeseType.find_by_cheese_type(params[:pate]) || CheeseType.find_by_cheese_type_in_french(params[:pate])
    @region = Region.find_by_region(params[:region])

    conditions = []
    count = 1
    3.times do
      if params[:composition].nil? || params[:composition].blank? || params[:composition] == "Tous" || params[:composition] == "All"
        if !@cheese_type.nil?
          if @region.nil? || @region.blank?
---
SELECT * FROM `cheese_types` WHERE (`cheese_types`.`cheese_type_in_french` IS NULL) LIMIT 1
SELECT * FROM `regions` WHERE (`regions`.`region` IS NULL) LIMIT 1
SELECT * FROM `regions`


    if params[:composition].nil? || params[:composition] == "All" || params[:composition].blank? || params[:composition] == "Tous"
      conditions.each do |condition|
        @cheeses << CheeseLibrary.find(:all, :conditions => condition, :order => "id desc")
---
SELECT * FROM `cheese_libraries` WHERE (milk_type_id = 1) ORDER BY id desc

  def show
    @cheeze = CheeseLibrary.find(params[:id])
    @title = @cheeze.cheese_title
    #set_index_session
    session[:cheese_order] = "id desc"
    session[:current_page] = get_page(params[:page]) if params[:page]
    @cheese = CheeseLibrary.find(:all, :conditions => ["id <= ? AND milk_type_id = ?", params[:id], @cheeze.milk_type.id], :order => session[:cheese_order])
---
SELECT * FROM `cheese_libraries` WHERE (id <= '1' AND milk_type_id = 2) ORDER BY id desc
SELECT * FROM `milk_types` WHERE (`milk_types`.`id` = 2)

  def edit
    if !@current_user.nil?
      @title = "Edit Cheese"
      set_index_session
      set_show_session

      @cheese = CheeseLibrary.find_by_id(params[:id])
      @selected_milk_type = (I18n.locale == 'en' ? MilkType.find_by_id(@cheese.milk_type_id).milk_type : MilkType.find_by_id(@cheese.milk_type_id).milk_type_in_french)
      @selected_region = Region.find_by_id(@cheese.region_id).region
      @selected_cheese_type = (I18n.locale == 'en' ? CheeseType.find_by_id(@cheese.cheese_type_id).cheese_type : CheeseType.find_by_id(@cheese.cheese_type_id).cheese_type_in_french)
---
SELECT * FROM `cheese_libraries` WHERE (`cheese_libraries`.`id` = '1') LIMIT 1
SELECT * FROM `milk_types` WHERE (`milk_types`.`id` = 2) LIMIT 1
SELECT * FROM `regions` WHERE (`regions`.`id` = 1) LIMIT 1
SELECT * FROM `cheese_types` WHERE (`cheese_types`.`id` = 3) LIMIT 1

  def create
    @cheese = CheeseLibrary.new(params[:cheese_library])

    respond_to do |format|
      if params[:commit] == "Cancel" || params[:commit] == "Annuler"
        format.html { redirect_to(cheese_libraries_path) }
      elsif (params[:commit] == "Save" || params[:commit] == "Sauf") && @cheese.save_obj(params)
---
INSERT INTO `cheese_libraries` (`wine_image_file_name`, `created_at`, `cheese_image_content_type`, `wine_image_file_size`, `cheese_image_file_name`, `cheese_image_file_size`, `deleted_at`, `updated_at`, `cheese_type_id`, `cheese_title`, `cheese_milk`, `wine_description`, `milk_type_id`, `region_id`, `description_in_french`, `wine_image_content_type`, `wine_description_in_french`, `milk_in_french`, `cheese_image_updated_at`, `maturing_period_in_french`, `average_weight`, `fat_content`, `wine_image_updated_at`, `maturing_period_in_english`, `description`, `aoc`) VALUES('Tulips.jpg', '2010-03-31 08:30:57', 'image/jpeg', 620888, 'Hydrangeas.jpg', 595284, NULL, '2010-03-31 08:30:57', 3, 'hgnbc', 'hnshs', 'k', 2, 1, 'jsj;', 'image/jpeg', 'k920`', 'asxz12', '2010-03-31 08:30:56', 'asxzcfre', '12', 12.0, '2010-03-31 08:30:57', 'aq123w', 'h', 'Yes')

  def update
    @cheese = CheeseLibrary.find_by_id(params[:id])

    respond_to do |format|
      if params[:commit] == "Cancel"
        format.html { redirect_to(cheese_libraries_path) }
      elsif @cheese.update_obj(params)
---
SELECT * FROM `cheese_libraries` WHERE (`cheese_libraries`.`id` = '1') LIMIT 1
UPDATE `cheese_libraries` SET `updated_at` = '2010-04-02 18:44:42', `aoc` = 'No' WHERE `id` = 1